必修 = {
    '程序设计基础':{'成绩':74,'学分':3,'绩点':3},
    '常微分方程':{'成绩':89,'学分':1,'绩点':4.5},
    '程序设计专题':{'成绩':84,'学分':2,'绩点':3.9},
    '大学物理甲I':{'成绩':80,'学分':4,'绩点':3.6},
    '大学物理甲II':{'成绩':83,'学分':4,'绩点':3.9},
    '大学物理实验':{'成绩':81,'学分':1.5,'绩点':3.6},
    '电路与模拟电子技术':{'成绩':85,'学分':5.5,'绩点':3.9},
    '电路与模拟电子技术实验':{'成绩':90,'学分':1.5,'绩点':4.5},
    '电子工程训练甲':{'成绩':89,'学分':1.5,'绩点':4.5},
    '电子系统设计':{'成绩':84,'学分':2,'绩点':3.9},
    '复变函数与积分变换':{'成绩':76,'学分':1.5,'绩点':3},
    '概率论与数理统计':{'成绩':78,'学分':2.5,'绩点':3.3},
    '工程训练':{'成绩':81,'学分':1.5,'绩点':3.6},
    '工程图学':{'成绩':66,'学分':2.5,'绩点':2.1},
    '光电信息科学与工程导论':{'成绩':92,'学分':1,'绩点':4.8},
    '光电应用实验':{'成绩':91,'学分':2.5,'绩点':4.5},
    '光电专业实习':{'成绩':90,'学分':3,'绩点':4.5},
    '光电子学':{'成绩':72,'学分':3,'绩点':2.7},
    '光机结构设计':{'成绩':95,'学分':2,'绩点':5},
    '光学系统设计':{'成绩':88,'学分':2,'绩点':4.2},
    '军事理论':{'成绩':83,'学分':1.5,'绩点':3.9},
    '军训':{'成绩':84,'学分':2,'绩点':3.9},
    '马克思主义基本原理概论':{'成绩':76,'学分':2.5,'绩点':3},
    '毛泽东思想与中国特色社会主义理论体系概论':{'成绩':79,'学分':5,'绩点':3.3},
    '偏微分方程':{'成绩':81,'学分':2,'绩点':3.6},
    '数字电路分析与设计':{'成绩':79,'学分':2.5,'绩点':3.3},
    '思想道德修养与法律基础':{'成绩':82,'学分':2.5,'绩点':3.6},
    '微积分甲I':{'成绩':88,'学分':4.5,'绩点':4.2},
    '微积分甲II':{'成绩':80,'学分':3.5,'绩点':3.6},
    '文献综述与科技写作':{'成绩':75,'学分':1.5,'绩点':3},
    '物理光学':{'成绩':87,'学分':4,'绩点':4.2},
    '物理光学实验':{'成绩':82,'学分':1,'绩点':3.6},
    '线性代数甲':{'成绩':75,'学分':2.5,'绩点':3},
    '形势与政策I':{'成绩':69,'学分':1,'绩点':2.4},
    '英语水平测试':{'成绩':75,'学分':1,'绩点':3},
    '应用光学':{'成绩':85,'学分':3,'绩点':3.9},
    '应用光学实验':{'成绩':82,'学分':1,'绩点':3.6},
    '中国近现代史纲要':{'成绩':86,'学分':2.5,'绩点':4.2},
    '专业认知实习':{'成绩':91,'学分':1,'绩点':4.5},
    '体育1 乒乓球初级':{'成绩':93,'学分':1,'绩点':4.8},
    '体育2 乒乓球中级':{'成绩':92,'学分':1,'绩点':4.8},
    '体育3 定向越野初级':{'成绩':93,'学分':1,'绩点':4.8},
    '体育4 定向越野初级':{'成绩':95,'学分':1,'绩点':5}
    }

第一组 = {
    '软件技术基础c':{'成绩':-1,'学分':3,'绩点':-1},
    '电磁场与电磁波':{'成绩':90,'学分':2.5,'绩点':4.5},
    '信号与系统乙':{'成绩':78,'学分':3,'绩点':3.3},
    '微机原理与接口技术':{'成绩':84,'学分':3.5,'绩点':3.9},
    '量子光学基础及应用':{'成绩':92,'学分':2.5,'绩点':4.8},
    '光电材料及应用':{'成绩':-1,'学分':2.5,'绩点':-1},
    '光电检测技术及系统':{'成绩':93,'学分':3,'绩点':4.8},
    '机器视觉与图像处理':{'成绩':82,'学分':3,'绩点':3.6},
    '光通信技术':{'成绩':78,'学分':2.5,'绩点':3.3},
    '光通信实验':{'成绩':-1,'学分':1.5,'绩点':-1}
    }

通识 = {
    '口才与沟通':{'成绩':79,'学分':1.5,'绩点':3.3},
    '人体结构功能与健康':{'成绩':84,'学分':1.5,'绩点':3.9},
    '化学与人类文明':{'成绩':82,'学分':1.5,'绩点':3.6},
    '摄影艺术':{'成绩':88,'学分':2,'绩点':4.2},
    '礼与中国社会':{'成绩':77,'学分':3,'绩点':3.2},
    '医学史':{'成绩':79,'学分':1.5,'绩点':3.3},
    '心理学及应用':{'成绩':80,'学分':1.5,'绩点':3.6}
    }

其他 = {
    '先进光学制造':{'成绩':82,'学分':1.5,'绩点':3.6},
    '颜色信息工程':{'成绩':81,'学分':2,'绩点':3.6},
    '视觉信息应用技术':{'成绩':89,'学分':2,'绩点':4.5},
    '数据通信与计算机网络':{'成绩':93,'学分':1.5,'绩点':4.8},
    '大学英语IV':{'成绩':77,'学分':3,'绩点':3.3},
    '创业基础':{'成绩':70,'学分':2,'绩点':2.5},
    '大学英语III':{'成绩':79,'学分':3,'绩点':3.3},
    '现代光学CAD技术':{'成绩':74,'学分':2,'绩点':3},
    '机器学习及应用':{'成绩':92,'学分':2,'绩点':4.8},
    '薄膜光学与技术':{'成绩':82,'学分':1.5,'绩点':3.6}
    }

成绩 = []
学分 = []
绩点 = []
文本 = '成绩.txt'

for 课 in 必修:
    成绩.append(必修[课]['成绩'])
    学分.append(必修[课]['学分'])
    绩点.append(必修[课]['绩点'])

for 课 in 第一组:
    成绩.append(第一组[课]['成绩'])
    学分.append(第一组[课]['学分'])
    绩点.append(第一组[课]['绩点'])

成绩和 = [ cj*学分[第几个] for 第几个,cj in enumerate(成绩) if cj > 0 ]
绩点和 = [ jd*学分[第几个] for 第几个,jd in enumerate(绩点) if jd > 0 ]
学分和 = [ fx for 第几个,fx in enumerate(学分) if 绩点[第几个] > 0 ]
四分绩 = []
for 第几个,jd in enumerate(绩点):
    if jd > 0:
        if jd > 4:
            jd = 4
        四分绩.append(jd*学分[第几个])

print('四分制\t= {:.2f}/{:.2f} = {:.2f}'
      .format(sum(四分绩), sum(学分和), sum(四分绩)/sum(学分和)))
print('五分制\t= {:.2f}/{:.2f} = {:.2f}'
      .format(sum(绩点和), sum(学分和), sum(绩点和)/sum(学分和)))
print('百分制\t= {:.2f}/{:.2f} = {:.2f}'
      .format(sum(成绩和), sum(学分和), sum(成绩和)/sum(学分和)))

with open(文本,'w') as file:
    file.writelines('专业四分制 = {:.2f}/{:.2f} = {:.2f}\n'
                    .format(sum(四分绩), sum(学分和), sum(四分绩)/sum(学分和)))
    file.writelines('专业五分制 = {:.2f}/{:.2f} = {:.2f}\n'
                    .format(sum(绩点和), sum(学分和), sum(绩点和)/sum(学分和)))
    file.writelines('专业百分制 = {:.2f}/{:.2f} = {:.2f}\n'
                    .format(sum(成绩和), sum(学分和), sum(成绩和)/sum(学分和)))
    file.close()

for 课 in 通识:
    成绩.append(通识[课]['成绩'])
    学分.append(通识[课]['学分'])
    绩点.append(通识[课]['绩点'])

for 课 in 其他:
    成绩.append(其他[课]['成绩'])
    学分.append(其他[课]['学分'])
    绩点.append(其他[课]['绩点'])

成绩和 = [ cj*学分[第几个] for 第几个,cj in enumerate(成绩) if cj > 0 ]
绩点和 = [ jd*学分[第几个] for 第几个,jd in enumerate(绩点) if jd > 0 ]
学分和 = [ fx for 第几个,fx in enumerate(学分) if 绩点[第几个] > 0 ]
四分绩 = []
for 第几个,jd in enumerate(绩点):
    if jd > 0:
        if jd > 4:
            jd = 4
        四分绩.append(jd*学分[第几个])

print('总-四分制\t= {:.2f}/{:.2f} = {:.2f}'
      .format(sum(四分绩), sum(学分和), sum(四分绩)/sum(学分和)))
print('总-五分制\t= {:.2f}/{:.2f} = {:.2f}'
      .format(sum(绩点和), sum(学分和), sum(绩点和)/sum(学分和)))
print('总-百分制\t= {:.2f}/{:.2f} = {:.2f}'
      .format(sum(成绩和), sum(学分和), sum(成绩和)/sum(学分和)))

lines = []
with open(文本,'r') as file:
    lines.append(file.readlines())
    file.close()

with open(文本,'w') as file:
    for line in lines:
        file.writelines(line)
    file.writelines('\n')
    file.writelines('总-四分制 = {:.2f}/{:.2f} = {:.2f}\n'
                    .format(sum(四分绩), sum(学分和), sum(四分绩)/sum(学分和)))
    file.writelines('总-五分制 = {:.2f}/{:.2f} = {:.2f}\n'
                    .format(sum(绩点和), sum(学分和), sum(绩点和)/sum(学分和)))
    file.writelines('总-百分制 = {:.2f}/{:.2f} = {:.2f}\n'
                    .format(sum(成绩和), sum(学分和), sum(成绩和)/sum(学分和)))

必修学分 = 0
for 课 in 必修:
    if 必修[课]['成绩'] > 0:
        必修学分 += 必修[课]['学分']
print(f'必修课学分:{必修学分}')

第一组学分 = 0
for 课 in 第一组:
    if 第一组[课]['成绩'] > 0:
        第一组学分 += 第一组[课]['学分']
print(f'第一组学分:{第一组学分}')

通识学分 = 0
for 课 in 通识:
    if 通识[课]['成绩'] > 0:
        通识学分 += 通识[课]['学分']
print(f'通识学分:{通识学分}')

其他学分 = 0
for 课 in 其他:
    if 其他[课]['成绩'] > 0:
        其他学分 += 其他[课]['学分']
print(f'其他学分:{其他学分}')

print(f'总学分{必修学分+第一组学分+通识学分+其他学分}')
